Repository: Daniel-KM/Omeka-S-module-Shibboleth
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: New options were added in the config to define a default role, to update the role automatically on login, and to store user settings on user creation.
fr: De nouvelles options ont été ajoutées dans la config pour définir un rôle par défaut, pour ajouter le rôle automatiquement à la connexion et pour enregistrer les paramètres utilisateurs à la création d’un utilisateur.

source: A fix has been done to store data on user creation to manage static and dynamic values.
fr: Un correctif a été ajouté pour enregistrer les données des nouveaux utilisateurs afin de gérer les valeurs statiques et dynamiques.

source: The module Shibboleth requires the php extension "ldap" to be installed. See {link}readme{link_end}.
fr: Le module Shibboleth requiert que le paquet composer « pear/neet_ldap2 » soit installé. Voir {link}readme{link_end}.

source: The module Shibboleth requires to be installed with composer or extracted from a release. See {link}readme{link_end}.
fr: Le module Shibboleth doit être installé par composer ou extrait d’une livraison. Voir {link}readme{link_end}.

source: The module Shibboleth requires the composer package "pear/neet_ldap2" to be installed. See {link}readme{link_end}.
fr: Le module Shibboleth requiert que le paquet composer « pear/neet_ldap2 » soit installé. Voir {link}readme{link_end}.

source: The module Shibboleth requires the Omeka config in "config/local.config.php" to be adapted to your ldap. See {link}readme{link_end}.
fr: Le module Shibboleth requiert que la config Omeka dans « config/local.config.php » soit adaptée à votre ldap. Voir {link}readme{link_end}.

source: Error in the config: the identityVar "{key}" is not found in extracted attributes.
fr: Erreur dans la config : la identityVar « {key} » n’a pas été trouvée dans les attributs extraits.

source: Error in the config: the identityVar "{key}" has multiple values.
fr: Erreur dans la config : la identityVar « {key} » a plusieurs valeurs.

source: User matching "{email}" not found.
fr: L’utilisateur correspondant à « {email} » n’a pas été trouvé.

source: Failed login attempt from ip "{ip}".
fr: Échec de la connexion depuis l’ip « {ip} ».

source: Error during authentication via Shibboleth: {message}
fr: Erreur durant l’authentification via Shibboleth : {message}

source: Error during authentication via Shibboleth.
fr: Erreur durant l’authentification via Shibboleth.

source: The resource you were trying to access is restricted.
fr: La ressource à laquelle vous souhaitez accéder est en accès restreint.
